In [1]:
import pandas as pd

df = pd.read_csv('../Apple462.csv')
df = df.drop(df[df["region"] != "UK"].index)
df = df.drop(columns=["Unnamed: 0"])
df

            Date   Envi   Fuji   Gala region
156   27/12/2015  30482   2972   5894     UK
157   20/12/2015  25628   2546   7394     UK
158   13/12/2015  27149   2986   6458     UK
159    6/12/2015  35591  12527   4086     UK
160   29/11/2015  24190   2790   6031     UK
...          ...    ...    ...    ...    ...
3340    4/2/2018          8511  22490     UK
3341   28/1/2018  66654   1972   6962     UK
3342   21/1/2018  49711   2157   6343     UK
3343   14/1/2018  49335   7415   8299     UK
3344    7/1/2018  45937   2658   7511     UK

[169 rows x 5 columns]

In [2]:
df_fuji = df.drop(columns=["Envi", "Gala", "region"])
df_fuji

df_fuji.to_csv("fuji.csv", sep=",", encoding="utf-8", index=False)